
# Полное расписание для двух групп
full_schedule = {
    'christian_theology': """
    Christian Theology ☦️
     ______________________________
    💀Понедельник:
    
        08:30-10:00 - Нет занятий
        10:10-11:40 - Нет занятий
        12:10-13:40 - Мастер-класс "Основы прогнозирования этнорелигиозных процессов" - Горин А.А.
        13:50-15:20 - Нет занятий
        15:50-17:20 - Безопасность жизнедеятельности - Хабибрахманов И.И.
        17:30-19:00 - Литургика - Ермошин А.В.
        19:10-20:40 - Нет занятий
      ______________________________
    📚Вторник:
    
        08:30-10:00 - Нет занятий
        10:10-11:40 - Нет занятий
        12:10-13:40 - Священное Писание Ветхого Завета - Ермошин А.В.
        13:50-15:20 - Нет занятий
        16.00-17.30 - 03.09.,10.09., 17.09,24.09.2024 Элективные курсы по физической культуре и спорту СК Бустан Марахтанова
        17:30-19:00 - Нет занятий
        19:10-20:40 - Нет занятий
     ______________________________
    🍭Среда:
    
        08:30-10:00 - Нет занятий
        10:10-11:40 - Философия религии - Токранов А.В
        12:10-13:40 - Патрология - Мелас С.
        13:50-15:20 - Нет занятий
        15:50-17:20 - Нет занятий
        17:30-19:00 - Нет занятий
        19:10-20:40 - Нет занятий
     ______________________________
    🎧Четверг:
    
        08:30-10:00 - Нет занятий
        10:10-11:40 - Древнегреческий язык - Востриков И.В.
        12.00-13.30 - Нет занятий
        12:10-13:40 - Нет занятий
        13:50-15:20 - Сравнительное богословие - Токранов А.В.
        15:50-17:20 - История философии средних веков - Кондратьев К.В.
        17:30-19:00 - Нет занятий
        19:10-20:40 - Нет занятий
     ______________________________
    🎮Пятница:  
    
        08:30-10:00 - Нет занятий
        10:10-11:40 - Русская Православная Церковь в современной России - Данилов А.
        12.00-13.30 - Нет занятий
        12:10-13:40 - Социология религии - Александрова Н.Н.
        13:50-15:20 - Нет занятий
        15:50-17:20 - Нет занятий
        16.00-17.30 - 04.10.2024: 11.10.2024 Элективные курсы по физической культуре и спорту Оренбург. Тракт, 10 Хакимов И.Ш
        17:30-19:00 - Нет занятий
        19:10-20:40 - Нет занятий
     ______________________________
    ⛪️Суббота:
    
        Выходной день
        
    """,
    'islamic_theology': """
    Islamic theology ☪️
      ______________________________
    ☠️Понедельник:
    
        08:30-10:00 - Нет занятий
        10:10-11:40 - Ислам в современной России - Горин А.А.
        12.00-13.30 - Нет занятий
        12:10-13:40 - Мастер-класс "Основы прогнозирования этнорелигиозных процессов" Горин А.А.
        13:50-15:20 - Нет занятий
        15:50-17:20 - Безопасность жизнедеятельности Хабибрахманов И.И.
        17:30-19:00 - Нет занятий
        19:10-20:40 - Нет занятий
     ______________________________
    📖Вторник:
    
        08:30-10:00 - Нет занятий
        10:10-11:40 - Нет занятий
        12:10-13:40 - Нет занятий
        13:50-15:20 - Нет занятий
        15:50-17:20 - Нет занятий
        16.00-17.30 - 03.09.,10.09., 17.09,24.09.2024 Элективные курсы по физической культуре и спорту СК - Бустан Марахтанова В.И.
        17:30-19:00 - Нет занятий
        19:10-20:40 - Нет занятий
     ______________________________
    🍫Среда:
    
        08:30-10:00 - Нет занятий
        10:10-11:40 - Нет занятий
        12.00-13.30 - Нет занятий
        12:10-13:40 - Нет занятий
        13:50-15:20 - Нет занятий
        15:50-17:20 - Систематическая теология конфессии: ашаритский и матуридитский калам 8-17 нед. лекц. Хамидов Е.Н.
        17:30-19:00 - Нет занятий
        19:10-20:40 - Нет занятий
     ______________________________
    ☕️Четверг:
    
        08:30-10:00 - Нет занятий
        10:10-11:40 - Нет занятий
        12:10-13:40 - Арабский язык - Хамидов Е.Н.
        13:50-15:20 - История и практики суфизма - Хамидов Е.Н.
        15:50-17:20 - Основы поклонения в исламе - Хамидов Е.Н.
        17:30-19:00 - Нет занятий
        19:10-20:40 - Нет занятий
     ______________________________
    🕌Пятница:
    
        08:30-10:00 - Нет занятий
        10:10-11:40 - Нет занятий
        12.00-13.30 - Социология религии - Александрова Н.Н.
        12:10-13:40 - Нет занятий
        13:50-15:20 - Нет занятий
        15:50-17:20 - Безопасность жизнедеятельности Хабибрахманов И.И.
        17:30-19:00 - Нет занятий.
        19:10-20:40 - Нет занятий
     ______________________________
    ⌛️Суббота:
        
        Выходной день
    
    """
}


# 08:30-10:00 - Нет занятий
        # 10:10-11:40 - Нет занятий
        # 12.00-13.30 - Нет занятий
        # 12:10-13:40 - Нет занятий
        # 13:50-15:20 - Нет занятий
        # 15:50-17:20 - Нет занятий
        # 17:30-19:00 - Нет занятий
        # 19:10-20:40 - Нет занятий

# schedule = {
#     'christian_theology': {
#         'monday': '09:00 - Нет занятий\n11:40 - Нет занятий\n12:10 - Мастер-класс "Основы прогнозирования этнорелигиозных процессов" - Горин А.А.',
#         'tuesday': '09:00 - Пастырское богословие\n11:00 - История Церкви',
#         'sunday': '00:00 - Исламская философия\n12:00 - Шариатское право'
#     },
#     'islamic_theology': {
#         'monday': '10:00 - Корановедение\n12:00 - Фикх\n15:00 - Арабский язык',
#         'tuesday': '10:00 - Исламская философия\n12:00 - Шариатское право',
#         'sunday': '00:00 - Исламская философия\n22:00 - Шариатское право'
#     }
# }

schedule = {
    'christian_theology': {
        'monday': """
        08:30-10:00 - Нет занятий
        10:10-11:40 - Нет занятий
        12:10-13:40 - Мастер-класс "Основы прогнозирования этнорелигиозных процессов" - Горин А.А.
        13:50-15:20 - Нет занятий
        15:50-17:20 - Безопасность жизнедеятельности - Хабибрахманов И.И.
        17:30-19:00 - Литургика - Ермошин А.В.
        19:10-20:40 - Нет занятий
        """,
        'tuesday': """
        08:30-10:00 - Нет занятий
        10:10-11:40 - Нет занятий
        12:10-13:40 - Священное Писание Ветхого Завета - Ермошин А.В.
        13:50-15:20 - Нет занятий
        16:00-17:30 - Элективные курсы по физической культуре и спорту - СК Бустан, Марахтанова
        17:30-19:00 - Нет занятий
        19:10-20:40 - Нет занятий
        """,
        'wednesday': """
        08:30-10:00 - Нет занятий
        10:10-11:40 - Философия религии - Токранов А.В.
        12:10-13:40 - Патрология - Мелас С.
        13:50-15:20 - Нет занятий
        15:50-17:20 - Нет занятий
        17:30-19:00 - Нет занятий
        19:10-20:40 - Нет занятий
        """,
        'thursday': """
        08:30-10:00 - Нет занятий
        10:10-11:40 - Древнегреческий язык - Востриков И.В.
        12:10-13:40 - Нет занятий
        13:50-15:20 - Сравнительное богословие - Токранов А.В.
        15:50-17:20 - История философии средних веков - Кондратьев К.В.
        17:30-19:00 - Нет занятий
        19:10-20:40 - Нет занятий
        """,
        'friday': """
        08:30-10:00 - Нет занятий
        10:10-11:40 - Русская Православная Церковь в современной России - Данилов А.
        12:10-13:40 - Социология религии - Александрова Н.Н.
        13:50-15:20 - Нет занятий
        15:50-17:20 - Элективные курсы по физической культуре и спорту - Оренбург, Хакимов И.Ш.
        17:30-19:00 - Нет занятий
        19:10-20:40 - Нет занятий
        """
    },
    'islamic_theology': {
        'monday': """
        08:30-10:00 - Нет занятий
        10:10-11:40 - Ислам в современной России - Горин А.А.
        12:10-13:40 - Мастер-класс "Основы прогнозирования этнорелигиозных процессов" - Горин А.А.
        13:50-15:20 - Нет занятий
        15:50-17:20 - Безопасность жизнедеятельности - Хабибрахманов И.И.
        17:30-19:00 - Нет занятий
        19:10-20:40 - Нет занятий
        """,
        'tuesday': """
        08:30-10:00 - Нет занятий
        10:10-11:40 - Нет занятий
        12:10-13:40 - Нет занятий
        13:50-15:20 - Нет занятий
        15:50-17:20 - Элективные курсы по физической культуре и спорту - СК Бустан, Марахтанова
        17:30-19:00 - Нет занятий
        19:10-20:40 - Нет занятий
        """,
        'wednesday': """
        08:30-10:00 - Нет занятий
        10:10-11:40 - Нет занятий
        12:10-13:40 - Нет занятий
        13:50-15:20 - Систематическая теология конфессии: ашаритский и матуридитский калам - Хамидов Е.Н.
        17:30-19:00 - Нет занятий
        19:10-20:40 - Нет занятий
        """,
        'thursday': """
        08:30-10:00 - Нет занятий
        10:10-11:40 - Арабский язык - Хамидов Е.Н.
        13:50-15:20 - История и практики суфизма - Хамидов Е.Н.
        15:50-17:20 - Основы поклонения в исламе - Хамидов Е.Н.
        17:30-19:00 - Нет занятий
        19:10-20:40 - Нет занятий
        """,
        'friday': """
        08:30-10:00 - Нет занятий
        10:10-11:40 - Социология религии - Александрова Н.Н.
        12:10-13:40 - Нет занятий
        13:50-15:20 - Нет занятий
        15:50-17:20 - Безопасность жизнедеятельности - Хабибрахманов И.И.
        17:30-19:00 - Нет занятий
        19:10-20:40 - Нет занятий
        """
    }
}
